src/test/java/pincode-search.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="3.2" jmeter="3.2 r1790748">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">50</stringProp>
        <stringProp name="ThreadGroup.ramp_time">5</stringProp>
        <longProp name="ThreadGroup.start_time">1501658645000</longProp>
        <longProp name="ThreadGroup.end_time">1501658645000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8081</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.concurrentPool">6</stringProp>
        </ConfigTestElement>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Pinsearch" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="pin" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">${pincode}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
                <stringProp name="Argument.name">pin</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8081</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/cache/postal/search</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <BeanShellPreProcessor guiclass="TestBeanGUI" testclass="BeanShellPreProcessor" testname="BeanShell PreProcessor" enabled="true">
            <stringProp name="parameters">pincode</stringProp>
            <boolProp name="resetInterpreter">false</boolProp>
            <stringProp name="script">import java.util.Random;

String[] pincodes = { &quot;110030&quot;, &quot;110031&quot;, &quot;110032&quot;, &quot;110033&quot;, &quot;110034&quot;, &quot;110035&quot;, &quot;110036&quot;, &quot;110037&quot;, &quot;110038&quot;,
				&quot;110039&quot;, &quot;202130&quot;, &quot;202131&quot;, &quot;202132&quot;, &quot;202133&quot;, &quot;202134&quot;, &quot;202135&quot;, &quot;202136&quot;, &quot;202137&quot;, &quot;202138&quot;,
				&quot;202139&quot;, &quot;400011&quot;, &quot;400001&quot;, &quot;400002&quot;, &quot;400003&quot;, &quot;400004&quot;, &quot;400005&quot;, &quot;400006&quot;, &quot;400007&quot;, &quot;400008&quot;,
				&quot;400009&quot;, &quot;504201&quot;, &quot;504202&quot;, &quot;504203&quot;, &quot;504204&quot;, &quot;504205&quot;, &quot;504206&quot;, &quot;504207&quot;, &quot;504208&quot;, &quot;504209&quot;,
				&quot;604201&quot;,&quot;604202&quot;,&quot;604203&quot;,&quot;604204&quot;,&quot;604205&quot;,&quot;604206&quot;,&quot;604207&quot;,&quot;604208&quot;,&quot;604209&quot;,&quot;604201&quot;,
				&quot;695020&quot;,&quot;695021&quot;,&quot;695022&quot;,&quot;695023&quot;,&quot;695024&quot;,&quot;695025&quot;,&quot;12345678&quot;,&quot;00000000&quot;,&quot;sadasd&quot;,&quot;-111&quot;
		};
Random rand = new Random();
pin=pincodes[rand.nextInt(pincodes.length)];
print(pin);
vars.put(&quot;pincode&quot;,pin);</stringProp>
          </BeanShellPreProcessor>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
    <WorkBench guiclass="WorkBenchGui" testclass="WorkBench" testname="WorkBench" enabled="true">
      <boolProp name="WorkBench.save">true</boolProp>
    </WorkBench>
    <hashTree/>
  </hashTree>
</jmeterTestPlan>